{"pages":[{"title":"About","text":"绸缪束刍，三星在隅。今夕何夕，见此邂逅。子兮子兮，如此邂逅何？","link":"/About/index.html"}],"posts":[{"title":"Github hexo 新手搭建博客教程","text":"免费方便，不用花一分钱就可以搭建一个自由的个人博客，不需要服务器不需要后台。 可以随意绑定自己的域名，多种多样的模板可供选择，也可以自己定制开发自己喜欢的模板。那么，让咱们开始吧！ 一、准备工作 - 下载Git 官网下载 - 下载Node.js 官网下载 - 注册Github Gtihub.com - 域名注册（可选） 阿里云 - 文本编辑器 （Notopad++，Sublime，Atom …）———-二、安装注册 1.安装Git双击安装程序，默认安装就可以。2.安装Nodejs双击安装程序，默认安装就可以。查看安装结果与版本12node -v #查看安装版本npm -v #查看npm安装版本 3.建立博客目录 新建博客文件目录，比如D:\\blog\\hexo ，右键该目录，点击Git Bash Here，启动Git 4.安装Hexo Hexo安装命令： npm install -g hexo 1npm install -g hexo 注册Github 5.建立仓库 注册完成之后， 新建一个名为 你的用户名.github.io的仓库，比如说，如果你的github用户名是xxx，那么你就新建xxx.github.io的仓库（必须是你的用户名，其它名称无效），将来你的网站访问地址就是 http://xxx.github.io 三、配置1.Hexo介绍 Hexo是一个简单、快速、强大的基于 Github Pages 的博客发布工具，支持Markdown格式，有众多优秀插件和主题。&emsp;官网： http://hexo.io&emsp;Github: https://github.com/hexojs/hexo由于github pages存放的都是静态文件，博客存放的不只是文章内容，还有文章列表、分类、标签、翻页等动态内容，假如每次写完一篇文章都要手动更新博文目录和相关链接信息，相信谁都会疯掉，所以hexo所做的就是将这些md文件都放在本地，每次写完文章后调用写好的命令来批量完成相关页面的生成，然后再将有改动的页面提交到github。注意事项： - 很多命令既可以用Windows的cmd来完成，也可以使用git bash来完成，但是部分命令会有一些问题，为避免不必要的问题，建议全部使用git bash来执行； - hexo不同版本差别比较大，网上很多文章的配置信息都是基于2.x的，所以注意不要被误导； - hexo有2种_config.yml文件，一个是根目录下的全局的_config.yml，一个是各个theme下的；2.npm镜像npm太慢， 淘宝npm镜像使用方法淘宝 npm 地址： http://npm.taobao.org/如何使用有很多方法来配置npm的registry地址，下面根据不同情境列出几种比较常用的方法。以淘宝npm镜像举例：临时使用1npm --registry https://registry.npm.taobao.org install express持久使用1npm config set registry https://registry.npm.taobao.org配置后可通过下面方式来验证是否成功1npm config get registry或 npm info express3.Hexo初始化初始化hexo模板,初始化之后，生成一些文件。初始化之前，新建一个空文件夹，因为非空不允许初始化，比如d:\\blog\\hexo ，进入该目录： cd /d/blog/hexo 输入命令1hexo init本地查看效果，执行下面语句，123hexo generate #生成hexo server #本地预览hexo g -s #合并使用，简写执行完即可登录查看效果: http://localhost:4000/4.安装hexo部署到git page的deployer1npm install hexo-deployer-git --save至此，hexo本地安装完成，下面是一些hexo简单编辑方法。5.Hexo文章编辑文章编辑有两种方式，一种是通过命令来创建新文章一种是创建MD格式的文件，编辑完成之后把.md 文件放到博客目录：…\\source_posts ，网上推荐Markdown编辑器，但是收费，可以选择其他的编辑器也有很多在线编辑器，比如CSDN创作中心等等文章中插入图片令人比较不方便，一般是选择将图片上传到图片网站，比如图床，七牛等等，之后再把图片地址复制到编辑器中。7.修改主题比如安装主题hexo-theme-yilia先下载这个主题，在博客目录下安装1git clone https://github.com/litten/hexo-theme-yilia.git themes/yilia配置修改hexo目录的_config.yml中的 theme: landscape 改为 theme: yilia更新12cd themes/yiliagit pull然后重新执行hexo g来重新生成。hexo s 本地预览———-四、hexo发布到Github 1._config.yml配置文件修改 hexo 3.0 部署类型不再是github，_config.yml 中修改为下面这个格式: (xxx为Github用户名)1234deploy: type: git repository: git@xxx.github.com:xxx/xxx.github.io.git branch: master 2.配置SSH key 为什么要配置这个呢？因为你提交代码肯定要拥有你的github权限才可以，但是直接使用用户名和密码太不安全了，所以我们使用ssh key来解决本地和服务器的连接问题。邮件地址为注册Github的邮箱1ssh-keygen -t rsa -C &quot;邮件地址&quot; 然后连续3次回车，最终会生成一个文件在用户目录下，打开用户目录，找到.ssh\\id_rsa.pub文件，记事本打开并复制里面的内容，打开你的github主页，进入个人设置 -&gt; SSH and GPG keys -&gt; New SSH key：将刚复制的内容粘贴到key那里，title随便填，保存。 3.SSH用户配置：12git config --global user.name &quot;xxx&quot; //你的github用户名，非昵称git config --global user.email &quot;xxx@qq.com&quot; //填写你的github注册邮箱 Github博客绑定自己的域名，在Setting 中填写自己的域名信息 4.域名解析设置 以阿里云的为例：IP地址，ping 你的GitHub博客地址就知道了，比如：ping xxx.github.io 5.将博客部署到Github Page上1hexo g -d 通过在浏览器中输入自己的域名来访问GitHub Pages博客。 参考资料：浅析 Hexo 搭建博客的原理Hexo DocsHexo主题制作指南写一个自己的Hexo主题","link":"/2018/06/24/Github hexo 新手搭建博客教程/"},{"title":"Don't Cry-Guns N' Roses","text":"Don’t Cry 是美国Hard Rock乐队枪炮与玫瑰的名曲，这首歌曾唱哭了千万人。总是能够触痛人心底最软的地方。Don’t Cry 这首歌中枪花乐队一改从前的愤怒激烈，主唱Axl Rose沧桑哀婉低吟出一段令人荡气回肠的柔情曲，而歌曲表达出的无奈和失意正是愤怒的极至。不止在歌收尾的地方，在歌起时就有淡淡的的呻吟声，而且在整首歌里拖长的音非常之多，歌曲最后通过一声加长的低鸣来表达一种撕心裂肺的心痛。 Guns N’ Roses组合是一支1985年成立于好莱坞的美国硬摇滚乐队，乐队共发行了五张录音室大碟、两张EP以及一张Live专辑，经历了大量乐队人事变动后，Axl是乐队仅存的创始成员。他们至今仍保持全美音乐史上处子专辑最高的销售记录（3300万张以上），在美国本土和世界上已经分别拥有4600万和1.1亿的专辑总销量以及两张专辑同时成为Billboard200排行榜冠亚军的神话。枪花在80年代中期至90年代早期这一巅峰时期，有评论认为：“他们带来了一个极端享乐主义的叛逆并复兴了硬摇乐界的朋克态度，让人想起早期的滚石。” 这首歌和他们的其它作品相比，是极其富有柔情的一首歌，音乐轻轻地响起，没有激烈的元素，没有强烈的词句，仿佛是情人间的低声耳语。前半部分带有悲凉的情调，后半部分高潮迭起的时候，他们加进了极其明显的金属元素，表达了炽烈的情感以及对于美好未来的期冀。从歌中我们仍然可以看出朋克音乐的一个特点 —— 矛盾性，他们有温柔的一面，也有激情的一面；有对生活的悲观失望，也有对未来的美好期待…… 世界上形形色色的人，当中总有一些人，纵然彼此说着不同的语言，甚至未曾谋面，他们却能在我们某些人生艰难的时刻，用音乐给予我们一份难能可贵的理解与安慰，我想这大概就是为何这首歌能如此打动人心，唱哭了千万人的原因吧。 Don’t Cry (Alternate版) 现场版 I know how you feel inside我了解你内心的感受I’ve been there before这感受我也有过Somethin’ is changin’ inside you你心里正发生着某种变化And don’t you know这你可知道Don’t you cry tonight今夜你可别哭 You gotta make it your own way这一切需要你自己来应对But you’ll be alright now sugar可你这就会好起来，亲爱的You’ll feel better tomorrow明天你会感觉很美好Come the morning light now baby清晨的阳光依旧会照耀着你","link":"/2018/07/18/Don't Cry-Guns N' Roses/"},{"title":"《Breath and ife》","text":"Breath and ife中文译为呼吸与生命，是Audiomachine的一首纯音乐。AUDIOMACHINE 中文为音频机器[trailermusic]厂牌的简称为AM，是属于华纳音乐旗下的LABEL。主要作曲家来自BMI大英作曲家协会的成员。当今世界上最顶级以及最负盛名的几家商业版权音乐出品厂牌之一。他们的音乐在广告电影领域也是独树一帜。DOTA及DOTA2多部游戏集锦曾用此曲做背景音乐。英雄联盟官方宣传片中曾用此曲做背景音乐。同时也作为各大电视台视频制作的背景音乐。 https://music.163.com/#/song?id=29809089&amp;autoplay=true&amp;market=baiduhd","link":"/2018/08/13/Breath and Life/"},{"title":"《Victory》- Two Steps From Hell","text":"《Victory》是Two Steps From Hell 的单曲，收录于《Battlecry》专辑。 《Battlecry》专辑是Two Steps From Hell 公司于2015年4月28日发布的第八张公开专辑，第一次发行的2CD专辑，专辑由Thomas Bergersen（托马斯·伯格森）和Nick Phoenix（尼克·菲尼克斯）完成26首曲目。歌曲人声参与有Merethe Soltvedt，Nick Phoenix和Felicia Farerre。专辑封面由Steven R. Gilmore设计。 Two Steps from Hell / 两步逃离地狱（又名 地狱边缘、地狱咫尺、两步逃离地狱、逃陷地域），成立于2006年3月，总部设于美国加州洛杉矶，是一家专业的音乐制作公司。Two Steps from Hell (以下简称TSFH) 是由尼克·菲尼克斯和托马斯·J·柏格森共同创办，他们创作的音乐类型属于SOUND TRACK（原声配乐），而现在此公司属于HANS ZIMMER (汉斯季莫) 旗下的RC公司所拥有。 他们的成名曲《勇敢之心》出现在2011年12月1日在马德里的世界青年日，再之后这首歌更被当作2012年欧洲锦标赛的开幕曲。随着与日俱增的人气，TSFH的乐曲也越来越常出现于收音机、网络影片、自制电影等 媒体之中，可谓新一代的音乐巨擘。 公司主要的预告片配乐作品：《香水:一个杀人犯的故事》、《血钻》、《勇敢的人》、《老无所依》、《星尘》、《国家宝藏》、《生化危机》、《黑暗物质:黄金罗盘》、《史前一万年》、《霍顿与无名氏》、《少年汉尼拔》、《达芬奇密码》、《1408幻影凶间》、《我是传奇》、《加勒比海盗3》、《通天塔》、《理发师陶德》、《X战警3》、《刺杀神枪侠》、《蜘蛛侠3》、《心灵传输者》、《木乃伊3》、《哈利波特5》、《地狱男爵2》、《贝奥武夫》、《Wall-E》、《夺宝奇兵4》、《神奇绿巨人》、《纳尼亚传奇2》、《蝙蝠侠:暗夜骑士》、《暮光之城》、《圣安娜奇迹》、《澳大利亚》、《小鼠侠》、《墨水心》、《星舰迷航》等。 《Victory》在YouTube的观看人数为9百万以上，创造了TSFH的新纪录，是目前为止TSFH最受欢迎的歌曲。让人震撼的女声和合唱，以及气势磅礴的旋律，足以征服听众的内心。http://music.163.com/song/31654455/?userid=439926622 (@网易云音乐)","link":"/2018/08/12/《Victory》- Two Steps From Hell/"},{"title":"茶道的顺序流程","text":"饮茶是中国人自古以来就有的习惯，了解茶道的人却寥寥无几，能知道茶道六君子、正确的饮茶方式和茶道流程的人简直是凤毛麟角，下面就为大家罗列什么是茶道六君子，以及茶道的正确顺序流程，教您做个真正的懂茶的人。 茶道六君子及其用法 茶道六君子(茶艺六用)指的是茶筒、茶匙、茶漏、茶则、茶夹、茶针。 1、茶筒：盛放茶艺用品的器皿茶器筒。 2、茶匙：又称「茶扒 」形状像汤匙所以称茶匙，其主要用途是挖取泡过的茶， 壶内茶叶，茶叶冲泡过后，往往会紧紧塞满茶壶，加上一般茶壶的口都不大，用手挖出茶叶既不方便也不卫生，故皆使用茶匙。 3、茶漏：茶漏则于置茶时放在壶口上，以导茶入壶，防止茶叶掉落壶外。 4、茶则：茶则(茶勺)茶则为盛茶入壶之用具。 5、茶夹：又称「茶铲」茶夹功用与茶匙相同，可将茶渣从壶中挟出，也常有人拿它来挟着茶杯洗杯，防烫又卫生。 6、茶针(茶通)： 茶针的功用是疏通茶壶的内网(蜂巢)，以保持水流畅通当壶嘴被茶叶堵住时用来疏浚，或放入茶叶后把茶叶拨匀，碎茶在底，整茶在上。 茶道六君子材质通常为竹木，竹制品气质清雅，木制品质感纯然，与茶香墨香相得益彰。 其他茶道配件：茶盘、茶席、茶巾、茶宠、茶垫、养壶笔、茶滤网。 茶道组是茶盘上最常用到、也最容易被忽略的物件，比如说茶漏，用盖碗或是壶泡茶都要用它来过滤茶渣。用来夹闻香杯和茶盏的茶镊，有木的、竹的、金属的。还有用来放品茗杯的茶垫，用来疏通壶口的茶签，以及茶勺和茶刮。所有这些，平时散放在茶盘上，专心喝茶的你可能不会去注意，分开来它们只是茶盘上的杂件，放在茶道瓶中，就成为茶道组了。这些茶漏、茶镊、茶垫等因为其使用功能的限制，其形状大都大同小异，就是材质、工艺上有所不同。 茶道组作为在整个茶艺中不可缺少的工具，更是品茗诗意画境的一道靓丽的风景，起到点缀之美，既是实用工具又是艺术的体现，让众多茶友爱不释手。其中可能吸引你眼球的，或许是用来存放组件的茶道瓶，其材质多样，造型各异，不只是有花鸟鱼虫，蕴意多多，也让茶道组因此而大大提高了其观赏性。 茶道的程序与流程 1、净手和欣赏器具：也就是洗手，喝茶卫生很重要，先引茶人荷，请来宾赏茶，然后是赏具，品茶讲究用景瓷宜陶–景德镇的瓷器或宜兴的紫砂壶为上，这个都是为了喝茶前有个放松心情的准备。 2、烫杯温壶：就是把茶叶器具都用开水冲洗一次，目的也是为了卫生清洁，同时给茶具预热，这样出来的茶的味道更香，将沸水倾入紫砂壶、公道杯、闻香杯、品茗杯中，也有朋友说这叫洁具提温。 3、马龙入宫：把茶叶放到器具里，也就是放茶过程到茶壶里，名字叫的好听，程序简单，表演可以适当加入花式，更具有茶韵。 4、洗茶：将沸水倒入壶中，让水和茶叶适当接触，然后又迅速倒出。目的是为了把茶叶表面的不清洁物质去掉，还有就是把没炒制好的茶叶过滤掉。 5、冲泡：把沸水再次倒入壶中，倒水过程中壶嘴“点头”三次，别一次把壶倒满，茶道的程序其实也只是好看而已，只有这步才是平时大家常用的，表演上有即所谓“凤凰三点头”，向客人示敬。 6、春风拂面：完全是表现技巧美观需求，水要高出壶口，用壶盖拂去茶末儿，把浮在上面的茶叶去掉，为的是只喝茶水不要让上面浮的茶叶到口中。 7、封壶：盖上壶盖，保存茶壶里茶叶冲泡出来的香气，用沸水遍浇壶身也是这个目的。 8、分杯：准备喝茶开始的步骤，用茶夹将闻香杯、品茗杯分组，放在茶托上，方便加茶。 9、玉液回壶：轻轻将壶中茶水倒入公道杯，使每个人都能品到色、香、味一致的茶。给人精神上的享受和感官上的刺激，简单点说就是给客人每人一杯茶。 10、分壶：然后将茶汤分别倒入每个客人的闻香杯，茶道的程序茶斟七分满，表示对客人的尊敬。 11、奉茶：把杯子双手送到客人面前注意倒茶礼仪，以茶奉客的中国古代礼仪之本。 12、闻香：客人开始独自感悟的步骤，客人将茶汤倒入品茶杯，轻嗅闻香杯中的余香，最好能有陶醉状，表示对主人茶的欣赏和赞叹。 13、品茗：客人用三指取品茗杯，分三口轻啜慢饮，然后放下，可以在谈话交流期间继续如此，显示茶在交流中的地位和必不可少身份。 14、续水：一般已经饮去 2/3(杯)的茶汤时，就应续水入壶(杯)。一到茶水全部饮尽时再续水，那么，续水后的茶汤就会淡而无味。续水通常二三次就足够了。如果还想继续饮茶，那么，应该重新冲泡。","link":"/2018/07/07/茶道的顺序流程/"},{"title":"That Friend Of Mine","text":"&emsp;&emsp; 第三十五届格莱美（1993）和第五十届格莱美（2008）最佳乡村男艺人 Vince Gill（文斯·基尔），1957年4月12日出生于美国奥克拉荷马州的诺曼（Norman），原名文斯·格兰特·基尔（Vince Grant Gill）。他的父亲是一名联邦法官，会弹班卓琴。基尔10岁开始学习吉他，上中学时就参加过当地一支叫”山雾”（Mountain Smoke）的乡村摇滚乐队。中学毕业后，他得到高尔夫运动员奖学金，到肯德基州的路易斯维尔（Louisville）上大学，很快便参加了一支叫”南方联盟”的乐队。此时他除了会弹奏吉他外，还会演奏曼陀林、小提琴和班卓琴。1979年，基尔来到纳什维尔并很快的成了音乐节上的红人。1984年，他的歌曲第一次进入乡村歌曲排行榜前40 名。此后，他的歌曲不断地在排行榜上取得佳绩。 &emsp;&emsp; 进入90 年代，基尔留下了辉煌的足迹，除了录制唱片外，他还是音乐会上的十大明星之一，两次获得乡村音乐协会的最佳艺人奖。他说：我希望有人记住我，我曾经关心过乡村音乐的完整性。我也喜欢当演员、当作曲家、做事业。同样，我关心历史，它从什么地方开始，他往哪儿发展。 &emsp;&emsp; 他的歌声让人触动内心心弦，值得用心去揣摩，去细细聆听 &emsp;&emsp; 当 Vince Gill 深情款款地唱着 That Friend Of Mine，心里看到的一定只有 Amy Grant 而已。听着听着，有时会想起 Michael Bolton 那首 How Can We Be Lovers If We Can’t Be Friends… 这些歌真正触动内心的地方，在于他们陈述的这样一个事实：友谊是可以地久天长的。 歌曲：That Friend Of Mine艺人：Vince Gill专辑∶Let’s Make Sure We Kiss Goodbye词曲：Vince Gill / Reed Nielsen That friend of mineWears an old work shirtFor a long long timeShe has blessed this earthAnd a smile that shinesEven when she hurtsO how I love that friend of mine That friend of mineGave her heart to meHow sweet and kindThe truth can beAnd God’s tieThat binds us as familyOh how I love that friend of mine She’s an angelShe’s the answerThe sweetest pieceOf heaven in my eyesShe’s drawn to me like gravityI’d lay down and dieFor that friend of mine She’s an angelShe’s the answerThe sweetest pieceOf heaven in my eyesShe’s drawn to me like gravityI’d lay down and dieFor that friend of mineI’d lay down and dieFor that friend of mine That friend of mineWears an old work shirt 我的那个朋友，穿着一身粗布衣裳，静静地倚在门廊边。不记得从什么时候开，她的存在令这个荒芜的世界，也开始变得生机盎然，不管内心里是悲是喜，她的脸上总会笑容绽放，噢，只有上天才能明了，我究竟有多爱这个朋友。 我的那个朋友，将心整个儿都交给了我，生活每一天因此而有意义，上帝手里那根细细的红线，注定是将你我缠绕在一起，噢，只有上天才能明了，我究竟有多爱这个朋友。 她善良宛若天使下凡，寻寻觅觅了大半生，原来答案就摆在眼前，我要将这份甜蜜的感情，珍藏在内心中最柔软的地方，穷尽一生也无法此向你解释，为何会被她深深吸引，然而为了这个朋友，奔赴刀山火海我也在所不辞。","link":"/2018/06/25/That Friend Of Mine/"},{"title":"野有蔓草","text":"《国风·郑风·野有蔓草》 野有蔓草，零露漙兮。有美一人，清扬婉兮。邂逅相遇，适我愿兮。 野有蔓草，零露瀼瀼。有美一人，婉如清扬。邂逅相遇，与子偕臧。","link":"/2018/06/01/野有蔓草/"},{"title":"古文经典","text":"1．天行健，君子以自强不息。地势坤，君子以厚德载物。 –《周易》译：作为君子，应该有坚强的意志，永不止息的奋斗精神，努力加强自我修养，完成并发展自己的学业或事业，能这样做才体现了天的意志，不辜负宇宙给予君子的职责和才能。2．勿以恶小而为之，勿以善小而不为。 –《三国志》刘备语译：对任何一件事，不要因为它是很小的、不显眼的坏事就去做；相反，对于一些微小的。却有益于别人的好事，不要因为它意义不大就不去做它。3．见善如不及，见不善如探汤。 –《论语》译：见到好的人，生怕来不及向他学习，见到好的事，生怕迟了就做不了。看到了恶人、坏事，就像是接触到热得发烫的水一样，要立刻离开，避得远远的。4．躬自厚而薄责于人，则远怨矣。 –《论语》译：干活抢重的，有过失主动承担主要责任是”躬自厚”，对别人多谅解多宽容，是”薄责于人”，这样的话，就不会互相怨恨。5．君子成人之美，不成人之恶。小人反是。 –《论语》译：君子总是从善良的或有利于他人的愿望出发，全心全意促使别人实现良好的意愿和正当的要求，不会用冷酷的眼光看世界。或是唯恐天下不乱，不会在别人有失败、错误或痛苦时推波助澜。小人却相反，总是”成人之恶，不成人之美”。 6．见贤思齐焉，见不贤而内自省也。 –《论语》译：见到有人在某一方面有超过自己的长处和优点，就虚心请教，认真学习，想办法赶上他，和他达到同一水平；见有人存在某种缺点或不足，就要冷静反省，看自己是不是也有他那样的缺点或不足。7．己所不欲，勿施于人。 –《论语》译：自己不想要的（痛苦、灾难、祸事……），就不要把它强加到别人身上去。8．当仁，不让于师。 –《论语》译：遇到应该做的好事，不能犹豫不决，即使老师在一旁，也应该抢着去做。后发展为成语 “当仁不让”。9．君子欲讷于言而敏于行。 –《论语》译：君子不会夸夸其谈，做起事来却敏捷灵巧。10．二人同心，其利断金；同心之言，其臭如兰。 –《周易》译：同心协力的人，他们的力量足以把坚硬的金属弄断；同心同德的人发表一致的意见，说服力强，人们就像嗅到芬芳的兰花香味，容易接受。 11．君子藏器于身，待时而动。 –《周易》译：君子就算有卓越的才能超群的技艺，也不会到处炫耀、卖弄。而是在必要的时刻把才能或技艺施展出来。12．满招损，谦受益。 –《尚书》译：自满于已获得的成绩，将会招来损失和灾害；谦逊并时时感到了自己的不足，就能因此而得益。13．人不知而不愠，不亦君子乎？ –《论语》译：如果我有了某些成就，别人并不理解，可我决不会感到气愤、委屈。这不也是一种君子风度的表现吗？14．言必信 ，行必果。 –《论语》译：说了的话，一定要守信用；确定了要干的事，就一定要坚决果敢地干下去。15．毋意，毋必，毋固，毋我。 –《论语》译：讲事实，不凭空猜测；遇事不专断，不任性，可行则行；行事要灵活，不死板；凡事不以”我”为中心，不自以为是，与周围的人群策群力，共同完成任务。 16．三人行，必有我师焉，择其善者而从之，其不善者而改之。–《论语》译：三个人在一起，其中必有某人在某方面是值得我学习的，那他就可当我的老师。我选取他的优点来学习，对他的缺点和不足，我会引以为戒，有则改之。17．君子求诸己，小人求诸人。 –《论语》译：君子总是责备自己，从自身找缺点，找问题。小人常常把目光射向别人，找别人的缺点和不足。 ?18．君子坦荡荡，小人长戚戚。 –《论语》译：君子心胸开朗，思想上坦率洁净，外貌动作也显得十分舒畅安定。小人心里欲念太多，心理负担很重，就常忧虑、担心，外貌、动作也显得忐忑不安，常是坐不定，站不稳的样子。19．不怨天，不尤人。 –《论语》译：遇到挫折与失败，绝不从客观上去找借口，绝不把责任推向别人，后来发展为成语”怨天尤人”。20．不迁怒，不贰过。 –《论语》译：犯了错误，不要迁怒别人，并且不要再犯第二次。） 21．小不忍，则乱大谋。 –《论语》译：不该干的事，即使很想去干，但坚持不干，叫”忍”。对小事不忍，没忍性，就会影响大局，坏了大事。22．小人之过也必文。 –《论语》译：小人对自己的过错必定加以掩饰。23．过而不改，是谓过矣。 –《论语》译：有了过错而不改正，这就是真的过错了。24．君子务本，本立而道生。 –《论语》译：君子致力于根本，确立了根本，”道”也就自然产生。25．君子耻其言而过其行。 –《论语》译：君子认为说得多做得少是可耻的。26．三思而后行。 –《论语》译：每做一件事情必须要经过反复的考虑后才去做。27．多行不义必自毙。 –《左传》译：坏事做得太多，终将自取灭亡。28．人谁无过，过而能改，善莫大焉。 –《左传》译：人都有可能犯错误，犯了猎误，只要改正了仍是最好的人。29．不以一眚掩大德。 –《左传》译：评价一个人时，不能因为一点过失就抹杀他的功劳。30．人一能之，己百之；人十能之，己千之。 –《中庸》译：人家一次就学通的，我如果花上百次的功夫，一定能学通。人家十次能掌握的，我要是学一千次，也肯定会掌握的。31．知耻近乎勇。 –《中庸》译：知道什么是可耻的行为，那就是勇敢的好表现。32．以五十步笑百步。 –《孟子》译：以为自己的错误比别人的小，缺点比别人少而沾沾自喜。33．君子莫大乎与人为善。 –《孟子》译：君子最大的长处就是用高尚、仁义的心去对待别人。34．人皆可以为尧舜。 –《孟子》译：只要肯努力去做，人人都可以成为尧舜那样的大圣人。35．千丈之堤，以蝼蚁之穴溃；百尺之室，以突隙之烟焚。 –《韩非子》译：千里大堤，因为有蝼蚁在打洞，可能会因此而塌掉决堤；百尺高楼，可能因为烟囱的缝隙冒出火星引起火灾而焚毁。36．言之者无罪，闻之者足以戒。 –《诗序》译：提出批评意见的人，是没有罪过的。听到别人的批评意见要仔细反省自己，有错就改正，无错就当作是别人给自己的劝告。37．良药苦于口而利于病，忠言逆于耳而利于行。 –《孔子家语》译：好的药物味苦但对治病有利；忠言劝诫的话听起来不顺耳却对人的行为有利。38．良言一句三冬暖，恶语伤人六月寒。 –明代谚语译：一句良善有益的话，能让听者即使在三冬严寒中也倍感温暖；相反，尖酸刻薄的恶毒语言，伤害别人的感情和自尊心，即使在六月大暑天，也会让人觉得寒冷。39．千经万典，孝悌为先。 –《增广贤文》译：千万种经典讲的道理，孝顺父母，友爱兄弟是最应该先做到的。40．善恶随人作，祸福自己招， –《增广贤文》译：好事坏事都是自己做的，灾祸幸福也全是由自己的言行招来的。41.学而不思则罔，思而不学则殆。 –《论语》译：只学习却不思考就不会感到迷茫，只空想却不学习就会疲倦而没有收获。42.知之为知之，不知为不知，是知也。 –《论语》译：知道就是知道，不知道应当说不知道，不弄虚作假，这才是明智的行为。43.业精于勤，荒于嬉；行成于思，毁于随。 –韩愈译：事业或学业的成功在于奋发努力，勤勉进取。太贪玩，放松要求便会一事无成；做人行事，必须谨慎思考，考虑周详才会有所成就。任性、马虎、随便只会导致失败。44.读书有三到：谓心到，眼到，口到。 –明 朱熹译：用心思考，用眼仔细看，有口多读，三方面都做得到位才是真正的读书。45.学而不厌，诲人不倦。 –《论语》译：努力学习却不感到满足，教导别人不感到厌倦。46.不积跬步，无以至千里，不积小流，无以成江海。 –《荀子 劝学》译：不把半步、一步积累起来，就不能走到千里远的地方，不把细流汇聚起来，就不能形成江河大海。47.欲穷千里目，更上一层楼。 –唐?王之涣《登颧雀楼》译：想看到更远更广阔的景物，你就要再上一层楼。想学到更多更深的知识，你就要比原来更努力。48.强中自有强中手，莫向人前满自夸。 –《警世通言》译：尽管你是一个强者，可是一定还有比你更强的人，所以不要在别人面前骄傲自满，自己夸耀自己。49.玉不琢，不成器；人不学，不知道。 –《礼记?学记》译：玉石不经过雕琢，不能成为有用的玉器；人不经过学习，就不懂得事理。50.黑发不知勤学早，白首方悔读书迟。 –《劝学》译：年轻的时候不知道抓紧时间勤奋学习，到老了想读书却为时已晚。 51.知不足者好学，耻下问者自满。 –林逋《省心录》译：知道自己的不足并努力学习就是聪明的人，不好问又骄傲自满的人是可耻的。52.学不可以已。 –《荀子》译：学习是不可以停止的。53.学而时习之，不亦悦乎？ –《论语》译：学过的知识，在适当的时候去复习它，使自己对知识又有了新的认识，这不是令人感到快乐的事吗？54.温故而知新，可以为师矣。 –《论语》译：学了新的知识又常常温习已学过的知识，不断地学习，温习，学问和修养一定会很快得到提高，这样的人就可以成为老师了。55.读书破万卷，下笔如有神。 –唐 杜甫译：读书读得多，写起文章来就会笔下生花，像有神助一样。56.少壮不努力，老大徒伤悲。 –《汉乐府 长歌行》译：年轻时不努力学习，年老了只能后悔、叹息。57.读书百遍，其义自见。 –《三国志》译：读书必须反复多次地读，这样才能明白书中所讲的意思。58.学而不化，非学也。 –宋 杨万里译：学习知识但不能灵活运用，不能称为学习。59.好学而不贰。 –《左传》译：爱好学习但不三心二意。60.学如不及，犹恐失之。 –.《论语 秦伯》译：学习知识时生怕追不上，追上了又害怕再失去。61.人而不学，其犹正墙面而立。 –《尚书》译：人如果不学习，就像面对墙壁站着，什么东西也看不见。62、知而好问，然后能才。 –《荀子》译：聪明的人还一定得勤学好问才能成才。63、学之广在于不倦，不倦在于固志。 –晋 葛洪译：学问的渊博在于学习时不知道厌倦，而学习不知厌倦在于有坚定的目标。64.学而不知道，与不学同；知而不能行，与不知同。 –黄睎译：学习知识不能从中明白一些道理，这和不学习没什么区别；学到了道理却不能运用，这仍等于没有学到道理。65.博观而约取，厚积而薄发。 –宋 苏轼译：广泛阅读，多了解古今中外的人和事，把其中好的部分牢牢记住；积累了大量的知识材料，到需要用时便可以很自如恰当地选择运用。66.差之毫厘，缪以千里。 –宋 陆九渊译：做任何事情，开始一定要认真地做好，如果做差了一丝一毫，结果会发现相差很远。67.盛年不重来，一日难再晨。 –晋 陶渊明译：美好的青春年华过去了就不会再来，一天不可能有两个早晨，要珍惜时光啊！）68、言之无文，行而不远。 –《左传》译：文章讲的内容或题材都很好，可表达不适当，那么欣赏的人就不会很多，难以传播千古。69.人之为学，不可自小，又不可自大。 –顾炎武译：学习时不要在渊博浩翰的知识面前感到自卑，也不能因为学到一点点知识而骄傲自满。70.好学近乎知，力行近乎仁，知耻近乎勇。 –《中庸》译：勤奋好学就接近智，做任何事情只要努力就接近仁，懂得了是非善恶就是勇的一种表现。 71.书到用时方恨少，事非经过不知难。 –陈廷焯译：知识总是在运用时才让人感到太不够了，许多事情如果不亲身经历过就不知道它有多难。72、笨鸟先飞早入林，笨人勤学早成材。 –《省世格言》译：飞得慢的鸟儿提早起飞就会比别的鸟儿早飞入树林，不够聪明的人只要勤奋努力，就可以比别人早成材。73.书山有路勤为径，学海无涯苦作舟。 –《增广贤文》译：勤奋是登上知识高峰的一条捷径，不怕吃苦才能在知识的海洋里自由遨游。74.学如逆水行舟，不进则退。 –《增广贤文》译：学习要不断进取，不断努力，就像逆水行驶的小船，不努力向前，就只能向后退。75.吾生也有涯，而知也无涯。 –《庄子》译：我的生命是有限的，而人类的知识是无限的。76.天下兴亡，匹夫有责。 –明 顾炎武译：国家的兴旺、衰败，每一个人都负有很大的责任。77.生于忧患，死于安乐。 –孟子译：逆境能使人的意志得到磨炼，使人更坚强。相反，时常满足于享受，会使人不求上进而逐渐落后。78.位卑未敢忘忧国。 –陆游《病起书怀》译：虽然自己地位低微，但是从没忘掉忧国忧民的责任。79.人生自古谁无死，留取丹心照汉青。 –宋 文天祥《过零丁洋》译：自古以来，谁都难免会死的，那就把一片爱国的赤胆忠心留在史册上吧！80.先天下之忧而忧，后天下之乐而乐。 –宋 范仲淹《岳阳楼记》译：为国家分忧时，比别人先，比别人急；享受幸福，快乐时，却让别人先，自己居后。 81.小来思报国，不是爱封侯。 –唐?岑参《关人赴安西》译：从小就想着报效祖国，而不是想着要封侯当官。）82.有益国家之事虽死弗避。 –明?吕坤《呻吟语 卷上》译：对国家有利的事情要勇敢地去做，就算有死亡的危险也不躲避。83.一寸山河一寸金。 –金 左企弓语译：祖国的每一寸山河比一寸黄金还要宝贵，是绝不能让给外人的。84.欲安其家，必先安于国。 –武则天译：如果想建立个人幸福的小家，必须先让国定安定，繁荣起来。85.捐躯赴国难，视死忽如归。 –三国 曹植《白马篇》译：在国家有危难的时候要敢于挺身而出，把死当作回家一样。86.风声、雨声、读书声，声声入耳；家事、国事、天下事，事事关心。–明?顾宪成译：风声、雨声、琅琅读书声，都进入我们的耳朵，所以，作为一个读书人，家事、国事，天下的事情，各种事情都应该关心，不能只是死读书。87.生当作人杰，死亦为鬼雄。 –宋 李清照《夏日绝句》译：活着的时候要做英雄，死后也要当英雄。88.利于国者爱之，害于国者恶之。 –《晏子春秋》译：对于国家有利的事就要热心地去做，对国家有害的事就要憎恶它，远离它。89.读书本意在元元。 –宋陆游译：读书的目的应该是掌握了知识后为社会和大众服务，而不是为了自己的升官发财。90.时穷节乃现，一一垂丹青。 –宋 文天祥译：历史上许多忠臣义士，在国家有难时，他们的节操就显现出来，一个个名垂史册。91.哀哀父母，生我劬劳。 –《诗经》译：想起父母，做子女的是多么为他们感到心痛啊！他们生我育我，花费了多少辛勤的劳动啊！ 92.报国之心，死而后已。–宋?苏轼译：报效祖国的志向到死都不会变。93.忧国忘家，捐躯济难，忠臣之志也。 –三国 曹植《求自诚表》译：忧虑国家大事忘记小家庭，为拯救国家危难而捐躯献身，这都是忠臣的志向。94.大丈夫处世，当扫除天下，安事一室乎？ –汉 陈蕃语译：有志气的人活在世上，应当敢于跟各种不利于国家的行为作斗争，哪能只满足于处理好自己小家的小事呢？95.君子之交淡如水，小人之交甘若醴。 –《庄子》译：君子之间的交往，像水一样的平淡、纯净，这样的友谊才会持久；往小人之间的交像甜酒一样的又浓又稠，但不会长久。 96.老吾老，以及人之老；幼吾幼，以及人之幼。 –《孟子》译：尊敬、爱戴别人的长辈，要像尊敬、爱戴自己长辈一样；爱护别人的儿女，也要像爱护自己的儿女一样.97.见侮而不斗，辱也。 –《公孙龙子》译：当正义遭到侮辱、欺凌却不挺身而出，是一种耻辱的表现。98.天下皆知取之为取，而莫知与之为取。 –《后汉书》译：人们都认为只有获取别人的东西才是收获，却不知道给予别人也是一种收获。99.人固有一死，或重于泰山，或轻于鸿毛。 –汉 司马迁《史记》译：人终究免不了一死，但死的价值不同，为了人民正义的事业而死就比泰山还重，而那些自私自利，损人利已的人之死就比鸿毛还轻。100.羊有跪乳之恩，鸦有反哺之义。 –《增广贤文》译：羊羔有跪下接受母乳的感恩举动，小乌鸦有衔食喂母鸦的情义，做子女的更要懂得孝顺父母?","link":"/2018/07/10/古文经典/"}],"tags":[{"name":"Technology","slug":"Technology","link":"/tags/Technology/"},{"name":"-Music","slug":"Music","link":"/tags/Music/"},{"name":"Lifestyle","slug":"Lifestyle","link":"/tags/Lifestyle/"}],"categories":[{"name":"Technology","slug":"Technology","link":"/categories/Technology/"},{"name":"Music","slug":"Music","link":"/categories/Music/"},{"name":"Lifestyle","slug":"Lifestyle","link":"/categories/Lifestyle/"}]}