{"pages":[],"posts":[{"title":"Getting Started with Minos","text":"Minos is a simple and retro styled Hexo theme which concentrates more on your ideas. Minos is very expressive as it has extensive plugin support, colorful code highlighting choices, flexible configurations and out-of-box multi-language support. Meanwhile, minimalism also makes Minos a great theme for both writers and readers who desire a better reading experience.","link":"/2018/06/25/Getting Started with Minos/"},{"title":"Configuring Minos","text":"Minos employs a prioritized configuration system to ensure flexibility and integrity of the configurations. With Minos, you can customize your site for every post and language variant without worrying about breaking the compilation. Minos will also remind you of any missing configurations if you intend to enable some features. ###Theme configurationsThe _config.yml file at the theme’s root contains configurations mostly relate to the layout and plugins. Configuration options, their meaning and default values are described in the _config.yml.example file. Some complex configurations, like search, share, comment and plugins, will also be explained with details in the following documentation.","link":"/2018/06/24/Configuring Minos/"},{"title":"Github hexo 搭建博客教程","text":"免费方便，不用花一分钱就可以搭建一个自由的个人博客，不需要服务器不需要后台。 可以随意绑定自己的域名，多种多样的模板可供选择，也可以自己定制开发自己喜欢的模板。那么，让咱们开始吧！ 一、准备工作 - 下载Git 官网下载 - 下载Node.js 官网下载 - 注册Github Gtihub.com - 域名注册（可选） 阿里云二、安装注册 安装Git&emsp;&emsp;双击安装程序，默认安装就可以。安装Hexo&emsp;&emsp;双击安装程序，默认安装就可以。安装Hexo 建立博客目录 新建博客文件目录，比如D:\\blog\\hexo ，右键该目录，点击Git Bash Here，启动Git 安装Hexo Hexo安装命令：$ npm install -g hexo 12npm install -g hexonpm install hexo-deployer-git --save 第一句是安装hexo，第二句是安装hexo部署到git page的deployer。 这样hexo就安装完成了。 注册Github 建立仓库 新建一个名为你的用户名.github.io的仓库，比如说，如果你的github用户名是test，那么你就新建test.github.io的仓库（必须是你的用户名，其它名称无效），将来你的网站访问地址就是 http://test.github.io 配置SSH key 为什么要配置这个呢？因为你提交代码肯定要拥有你的github权限才可以，但是直接使用用户名和密码太不安全了，所以我们使用ssh key来解决本地和服务器的连接问题。1ssh-keygen -t rsa -C &quot;邮件地址&quot; 然后连续3次回车，最终会生成一个文件在用户目录下，打开用户目录，找到.ssh\\id_rsa.pub文件，记事本打开并复制里面的内容，打开你的github主页，进入个人设置 -&gt; SSH and GPG keys -&gt; New SSH key：将刚复制的内容粘贴到key那里，title随便填，保存。 SSH用户配置：12git config --global user.name &quot;liuxianan&quot; //你的github用户名，非昵称git config --global user.email &quot;xxx@qq.com&quot; //填写你的github注册邮箱 域名解析设置，以阿里云的为例：IP地址，ping 你的GitHub博客地址就知道了，比如：ping xxx.github.io 三、配置、整合发布Hexo配置介绍 Hexo是一个简单、快速、强大的基于 Github Pages 的博客发布工具，支持Markdown格式，有众多优秀插件和主题。 &emsp;官网： http://hexo.io&emsp;Github: https://github.com/hexojs/hexo 由于github pages存放的都是静态文件，博客存放的不只是文章内容，还有文章列表、分类、标签、翻页等动态内容，假如每次写完一篇文章都要手动更新博文目录和相关链接信息，相信谁都会疯掉，所以hexo所做的就是将这些md文件都放在本地，每次写完文章后调用写好的命令来批量完成相关页面的生成，然后再将有改动的页面提交到github。 注意事项： 很多命令既可以用Windows的cmd来完成，也可以使用git bash来完成，但是部分命令会有一些问题，为避免不必要的问题，建议全部使用git bash来执行； hexo不同版本差别比较大，网上很多文章的配置信息都是基于2.x的，所以注意不要被误导； hexo有2种_config.yml文件，一个是根目录下的全局的_config.yml，一个是各个theme下的； 初始化初始化hexo模板,初始化之后，生成一些文件。1hexo init 本地查看效果，执行下面语句，执行完即可登录localhost:4000查看效果12hexo generatehexo server 也可以使用简写： hexo g -s Hexo 命令介绍：1234567891011121314151617181920212223242526272829303132333435363738394041**hexo**npm install hexo -g #安装 npm update hexo -g #升级 hexo init #初始化**简写**hexo n &quot;我的博客&quot; == hexo new &quot;我的博客&quot; #新建文章hexo p == hexo publishhexo g == hexo generate#生成hexo s == hexo server #启动服务预览hexo d == hexo deploy#部署hexo clean #清除缓存 网页正常情况下可以忽略此条命令hexo g #生成静态网页hexo d #开始部署**完成后部署**两个命令的作用是相同的hexo generate --deployhexo deploy --generatehexo deploy -ghexo server -g**草稿**hexo publish [layout] &lt;title&gt;**模版**hexo new &quot;postName&quot; #新建文章hexo new page &quot;pageName&quot; #新建页面hexo generate #生成静态页面至public目录hexo server #开启预览访问端口（默认端口4000，&apos;ctrl + c&apos;关闭server）hexo deploy #将.deploy目录部署到GitHubhexo new [layout] &lt;title&gt;hexo new photo &quot;My Gallery&quot;hexo new &quot;Hello World&quot; --lang tw**变量描述**layout 布局title 标题date 文件建立日期 Hexo文章编辑文章编辑有两种方式，一种是通过命令来创建新文章另一种是直接编辑post文件.md ，post文件地址：\\source_posts ，网上推荐Markdown编辑器，但是收费也有很多在线编辑器，比如我使用的CSDN创作中心等等文章中插入图片令人比较不方便，一般是选择将图片上传到图片网站，比如图床，七牛等等，我选择的是https://sm.ms之后再把图片地址复制到编辑器中。再md文件的顶端输入标签代码：12345678910---title: 使用Hexo搭建个人博客layout: postdate: 2014-03-03 19:07:43comments: truecategories: Blogtags: [Hexo]keywords: Hexo, Blogdescription: 生命在于折腾，又把博客折腾到Hexo了。给Hexo点赞。--- 将博客部署到Github Page上 hexo 3.0 部署类型不再是github，_config.yml 中修改: ( *为Github用户名)1234deploy: type: git repository: git@***.github.com:***/***.github.io.git branch: master 推送到服务器上(github)hexo g #生成hexo d #部署hexo g -d# 命令合并使用 通过在浏览器中输入自己的域名来访问GitHub Pages博客。（教程不完整，仅供参考，如有问题请多多包涵^）","link":"/2018/06/24/Github hexo 新手搭建博客教程/"},{"title":"That Friend Of Mine","text":"&emsp;&emsp; 第三十五届格莱美（1993）和第五十届格莱美（2008）最佳乡村男艺人 Vince Gill（文斯·基尔），1957年4月12日出生于美国奥克拉荷马州的诺曼（Norman），原名文斯·格兰特·基尔（Vince Grant Gill）。他的父亲是一名联邦法官，会弹班卓琴。基尔10岁开始学习吉他，上中学时就参加过当地一支叫”山雾”（Mountain Smoke）的乡村摇滚乐队。中学毕业后，他得到高尔夫运动员奖学金，到肯德基州的路易斯维尔（Louisville）上大学，很快便参加了一支叫”南方联盟”的乐队。此时他除了会弹奏吉他外，还会演奏曼陀林、小提琴和班卓琴。1979年，基尔来到纳什维尔并很快的成了音乐节上的红人。1984年，他的歌曲第一次进入乡村歌曲排行榜前40 名。此后，他的歌曲不断地在排行榜上取得佳绩。 &emsp;&emsp; 进入90 年代，基尔留下了辉煌的足迹，除了录制唱片外，他还是音乐会上的十大明星之一，两次获得乡村音乐协会的最佳艺人奖。他说：我希望有人记住我，我曾经关心过乡村音乐的完整性。我也喜欢当演员、当作曲家、做事业。同样，我关心历史，它从什么地方开始，他往哪儿发展。 &emsp;&emsp; 他的歌声让人触动内心心弦，值得用心去揣摩，去细细聆听 &emsp;&emsp; 当 Vince Gill 深情款款地唱着 That Friend Of Mine，心里看到的一定只有 Amy Grant 而已。听着听着，有时会想起 Michael Bolton 那首 How Can We Be Lovers If We Can’t Be Friends… 这些歌真正触动内心的地方，在于他们陈述的这样一个事实：友谊是可以地久天长的。 歌曲：That Friend Of Mine艺人：Vince Gill专辑∶Let’s Make Sure We Kiss Goodbye词曲：Vince Gill / Reed Nielsen That friend of mineWears an old work shirtFor a long long timeShe has blessed this earthAnd a smile that shinesEven when she hurtsO how I love that friend of mine That friend of mineGave her heart to meHow sweet and kindThe truth can beAnd God’s tieThat binds us as familyOh how I love that friend of mine She’s an angelShe’s the answerThe sweetest pieceOf heaven in my eyesShe’s drawn to me like gravityI’d lay down and dieFor that friend of mine She’s an angelShe’s the answerThe sweetest pieceOf heaven in my eyesShe’s drawn to me like gravityI’d lay down and dieFor that friend of mineI’d lay down and dieFor that friend of mine That friend of mineWears an old work shirt 我的那个朋友，穿着一身粗布衣裳，静静地倚在门廊边。不记得从什么时候开，她的存在令这个荒芜的世界，也开始变得生机盎然，不管内心里是悲是喜，她的脸上总会笑容绽放，噢，只有上天才能明了，我究竟有多爱这个朋友。 我的那个朋友，将心整个儿都交给了我，生活每一天因此而有意义，上帝手里那根细细的红线，注定是将你我缠绕在一起，噢，只有上天才能明了，我究竟有多爱这个朋友。 她善良宛若天使下凡，寻寻觅觅了大半生，原来答案就摆在眼前，我要将这份甜蜜的感情，珍藏在内心中最柔软的地方，穷尽一生也无法此向你解释，为何会被她深深吸引，然而为了这个朋友，奔赴刀山火海我也在所不辞。","link":"/2018/06/25/That Friend Of Mine/"}],"tags":[{"name":"Lifestyle","slug":"Lifestyle","link":"/tags/Lifestyle/"},{"name":"Technology","slug":"Technology","link":"/tags/Technology/"}],"categories":[{"name":"Lifestyle","slug":"Lifestyle","link":"/categories/Lifestyle/"},{"name":"Technology","slug":"Technology","link":"/categories/Technology/"},{"name":"Music","slug":"Music","link":"/categories/Music/"}]}